ci-app/app/Models/BookModel.php

    public function get_all_books()
    {
        return $this->findAll();
---
SELECT *
FROM `books`

    public function insert_book($data)
    {
        return $this->save($data);
---
INSERT INTO `books` (`title`, `author`, `genre`, `publication_year`) VALUES ('DB test', 'John', 'GGG', '2022')

    public function update_book($id, $data)
    {
        return $this->update($id, $data);
---
UPDATE `books` SET `title` = 'DataBase System', `author` = 'John', `genre` = 'Doe', `publication_year` = '0000'
WHERE `books`.`bookID` IN ('15')

    public function get_book($id)
    {
        return $this->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`bookID` = '14'

    public function delete_book($id)
    {
        return $this->delete($id);
---
DELETE FROM `books`
WHERE `bookID` IN ('14')